{
  "0": "The customer is asking for detailed nutritional analysis and sourcing information about the protein content and chicken meal quality in the Premium Adult dog food formula due to concerns about their dog's decreased energy levels.",
  "1": "The customer is asking about potential food allergies after their cat developed vomiting and lethargy symptoms following a switch to the Salmon & Rice formula.",
  "2": "The customer is asking for expedited delivery or tracking updates for a delayed monthly subscription order because their pet is running low on food.",
  "3": "The customer is asking for a comparison between the Nature's Best and Premium Plus product lines to determine if upgrading would be beneficial for their senior German Shepherd.",
  "4": "The customer is asking about recent ingredient changes in the Indoor Cat formula after their cat developed severe digestive issues that the vet suspects are food intolerance-related.",
  "5": "The customer is asking about quality control measures after receiving a bag of Puppy Growth formula with unusual smell and oily texture that their dog refuses to eat.",
  "6": "The customer is asking for a quick exchange after receiving the wrong flavor in their order (Chicken instead of Fish) for their picky cat.",
  "7": "The customer is asking for product recommendations when switching from Classic to Holistic Wellness line for their Husky with sensitive skin and allergies.",
  "8": "The customer is asking if ingredients in the Limited Ingredient Diet (duck protein or sweet potato) could be causing their dog's excessive scratching and skin irritation.",
  "9": "The customer is asking if inconsistent kibble sizes in the Senior Cat formula represent a quality issue or normal variation.",
  "10": "The customer is asking for an urgent replacement after receiving a damaged order with contaminated food due to a torn bag during shipping.",
  "11": "The customer is asking for an explanation of the differences between Indoor Formula and Weight Management products for their overweight indoor cat.",
  "12": "The customer is asking what could be causing persistent loose stools in their dog after properly transitioning to the High Protein formula.",
  "13": "The customer is asking about safety concerns after finding what appears to be plastic fragments in their pet's wet food can.",
  "14": "The customer is asking for a restock timeline for the backordered Kidney Support formula needed for their pet's medical dietary requirements.",
  "15": "The customer is asking for clarification on the differences between Grain-Free and Ancient Grains lines due to conflicting information about DCM risks in cats.",
  "16": "The customer is asking if increased water consumption and urination in their dog could be related to the Senior Dog formula or if veterinary attention is needed.",
  "17": "The customer is asking if the recipe has changed after noticing their pet's wet food has become more watery and less chunky, affecting palatability.",
  "18": "The customer is asking to adjust their auto-ship delivery schedule after receiving an early shipment that resulted in excess inventory and freshness concerns.",
  "19": "The customer is asking about potential product recalls after their dog developed severe symptoms (refusing food, nausea, weight loss) following introduction of the new Venison & Sweet Potato formula."
}