[
    {
        "id": 1,
        "customer_name": "Sarah Johnson",
        "pet_type": "dog",
        "pet_name": "Max",
        "category": "quality",
        "message": "Hi, I'm concerned about the protein content in your Premium Adult formula. My Golden Retriever Max seems less energetic lately. Can you provide detailed nutritional analysis and sourcing information for the chicken meal?",
        "timestamp": "2025-06-25T10:30:00Z",
        "response": "Hi Sarah, thank you for reaching out. Our Premium Adult formula contains 26% protein with chicken meal sourced from USDA-inspected facilities. The chicken meal provides concentrated protein (65% protein content). However, decreased energy could indicate various factors. I recommend consulting your vet to rule out health issues. We're happy to send you our complete nutritional analysis and can suggest our High Energy formula if appropriate after vet consultation.",
        "response_timestamp": "2025-06-25T11:15:00Z",
        "status": "resolved",
        "answer_id": 0
    },
    {
        "id": 21,
        "customer_name": "Michelle Turner",
        "pet_type": "dog",
        "pet_name": "Charlie",
        "category": "quality",
        "message": "I need to know more about the protein levels in your Premium Adult dog food. My Golden Retriever Charlie hasn't been as active as usual, and I'm wondering about the quality and source of the chicken meal used in this formula.",
        "timestamp": "2025-06-25T10:30:00Z",
        "response": "Hi Michelle, thank you for reaching out. Our Premium Adult formula contains 26% protein with chicken meal sourced from USDA-inspected facilities. The chicken meal provides concentrated protein (65% protein content). However, decreased energy could indicate various factors. I recommend consulting your vet to rule out health issues. We're happy to send you our complete nutritional analysis and can suggest our High Energy formula if appropriate after vet consultation.",
        "response_timestamp": "2025-06-25T11:15:00Z",
        "status": "resolved",
        "answer_id": 0
    },
    {
        "id": 41,
        "customer_name": "Patricia Williams",
        "pet_type": "dog",
        "pet_name": "Duke",
        "category": "quality",
        "message": "Could you share the nutritional breakdown of your Premium Adult formula? My Golden Retriever Duke has been showing less energy recently, and I want to understand the protein content and where you source your chicken meal from.",
        "timestamp": "2025-06-25T10:30:00Z",
        "response": "Hi Patricia, thank you for reaching out. Our Premium Adult formula contains 26% protein with chicken meal sourced from USDA-inspected facilities. The chicken meal provides concentrated protein (65% protein content). However, decreased energy could indicate various factors. I recommend consulting your vet to rule out health issues. We're happy to send you our complete nutritional analysis and can suggest our High Energy formula if appropriate after vet consultation.",
        "response_timestamp": "2025-06-25T11:15:00Z",
        "status": "resolved",
        "answer_id": 0
    },
    {
        "id": 2,
        "customer_name": "Mike Chen",
        "pet_type": "cat",
        "pet_name": "Whiskers",
        "category": "health_problem",
        "message": "My cat Whiskers has been vomiting for 3 days after switching to your new Salmon & Rice formula. She's also showing signs of lethargy. Should I be concerned about food allergies?",
        "timestamp": "2025-06-24T14:22:00Z",
        "response": "Hi Mike, I'm very concerned about Whiskers' symptoms. Please discontinue the Salmon & Rice formula immediately and contact your veterinarian today. Vomiting for 3 days with lethargy requires immediate medical attention. This could indicate food intolerance, allergies, or other serious conditions. Please keep the product packaging for your vet's reference. We'll arrange a full refund and help identify a suitable alternative once Whiskers is healthy.",
        "response_timestamp": "2025-06-24T15:30:00Z",
        "status": "escalated",
        "answer_id": 1
    },
    {
        "id": 22,
        "customer_name": "Jennifer Adams",
        "pet_type": "cat",
        "pet_name": "Felix",
        "category": "health_problem",
        "message": "Ever since I started giving Felix your Salmon & Rice formula, he's been throwing up daily for the past three days and seems very tired. Could this be an allergic reaction to something in the food?",
        "timestamp": "2025-06-24T14:22:00Z",
        "response": "Hi Jennifer, I'm very concerned about Felix' symptoms. Please discontinue the Salmon & Rice formula immediately and contact your veterinarian today. Vomiting for 3 days with lethargy requires immediate medical attention. This could indicate food intolerance, allergies, or other serious conditions. Please keep the product packaging for your vet's reference. We'll arrange a full refund and help identify a suitable alternative once Felix is healthy.",
        "response_timestamp": "2025-06-24T15:30:00Z",
        "status": "escalated",
        "answer_id": 1
    },
    {
        "id": 42,
        "customer_name": "Robert Martinez",
        "pet_type": "cat",
        "pet_name": "Shadow",
        "category": "health_problem",
        "message": "Shadow started your new Salmon & Rice cat food three days ago and has been sick to his stomach every day since, plus he's barely moving around. I'm worried this might be a food allergy - what should I do?",
        "timestamp": "2025-06-24T14:22:00Z",
        "response": "Hi Robert, I'm very concerned about Shadow's symptoms. Please discontinue the Salmon & Rice formula immediately and contact your veterinarian today. Vomiting for 3 days with lethargy requires immediate medical attention. This could indicate food intolerance, allergies, or other serious conditions. Please keep the product packaging for your vet's reference. We'll arrange a full refund and help identify a suitable alternative once Shadow is healthy.",
        "response_timestamp": "2025-06-24T15:30:00Z",
        "status": "escalated",
        "answer_id": 1
    },
    {
        "id": 3,
        "customer_name": "Emma Rodriguez",
        "pet_type": "dog",
        "pet_name": "Bella",
        "category": "shipment",
        "message": "My monthly subscription order was supposed to arrive yesterday but tracking shows it's still in transit. Bella is almost out of her Grain-Free Lamb formula. Can you expedite or provide a tracking update?",
        "timestamp": "2025-06-26T09:15:00Z",
        "response": "Hi Emma, I apologize for the delay. I've checked your tracking and see the package is delayed due to weather. I'm immediately shipping an expedited replacement via overnight delivery at no charge. You'll receive tracking within 2 hours. Your original order will still arrive, so please keep it for future use or we can arrange return pickup. I've also added a credit to your account for the inconvenience.",
        "response_timestamp": "2025-06-26T10:00:00Z",
        "status": "resolved",
        "answer_id": 2
    },
    {
        "id": 23,
        "customer_name": "Angela Cooper",
        "pet_type": "dog",
        "pet_name": "Ruby",
        "category": "shipment",
        "message": "My auto-delivery was scheduled for yesterday but it hasn't shown up yet - the tracking says it's still on the way. Ruby is running low on her Grain-Free Lamb food. Is there any way to speed this up or get an update?",
        "timestamp": "2025-06-26T09:15:00Z",
        "response": "Hi Angela, I apologize for the delay. I've checked your tracking and see the package is delayed due to weather. I'm immediately shipping an expedited replacement via overnight delivery at no charge. You'll receive tracking within 2 hours. Your original order will still arrive, so please keep it for future use or we can arrange return pickup. I've also added a credit to your account for the inconvenience.",
        "response_timestamp": "2025-06-26T10:00:00Z",
        "status": "resolved",
        "answer_id": 2
    },
    {
        "id": 43,
        "customer_name": "Steven Clark",
        "pet_type": "dog",
        "pet_name": "Molly",
        "category": "shipment",
        "message": "I expected my regular monthly order to be delivered yesterday, but when I check the tracking it still shows in transit. Molly's Grain-Free Lamb formula is nearly finished. Can you rush a replacement or tell me what's happening?",
        "timestamp": "2025-06-26T09:15:00Z",
        "response": "Hi Steven, I apologize for the delay. I've checked your tracking and see the package is delayed due to weather. I'm immediately shipping an expedited replacement via overnight delivery at no charge. You'll receive tracking within 2 hours. Your original order will still arrive, so please keep it for future use or we can arrange return pickup. I've also added a credit to your account for the inconvenience.",
        "response_timestamp": "2025-06-26T10:00:00Z",
        "status": "resolved",
        "answer_id": 2
    },
    {
        "id": 4,
        "customer_name": "James Wilson",
        "pet_type": "dog",
        "pet_name": "Rocky",
        "category": "brand",
        "message": "I've been feeding Rocky your Nature's Best line for 2 years. How does it compare to your new Premium Plus series? Is it worth switching for a 7-year-old German Shepherd?",
        "timestamp": "2025-06-23T16:45:00Z",
        "response": "Hi James, great question! Premium Plus offers enhanced joint support with glucosamine/chondroitin and higher omega-3 levels - perfect for Rocky's age and breed. It has 28% protein vs Nature's Best 24%, plus probiotics for digestive health. For a 7-year-old German Shepherd, the joint support benefits would be significant. I'd recommend a gradual 7-day transition. Would you like a sample pack to see how Rocky responds before committing to a full bag?",
        "response_timestamp": "2025-06-23T17:20:00Z",
        "status": "resolved",
        "answer_id": 3
    },
    {
        "id": 24,
        "customer_name": "Thomas Reed",
        "pet_type": "dog",
        "pet_name": "Bruno",
        "category": "brand",
        "message": "Bruno has been eating your Nature's Best formula for the past two years. I'm curious about your Premium Plus line - would it be beneficial to make the switch for my 7-year-old German Shepherd?",
        "timestamp": "2025-06-23T16:45:00Z",
        "response": "Hi Thomas, great question! Premium Plus offers enhanced joint support with glucosamine/chondroitin and higher omega-3 levels - perfect for Bruno's age and breed. It has 28% protein vs Nature's Best 24%, plus probiotics for digestive health. For a 7-year-old German Shepherd, the joint support benefits would be significant. I'd recommend a gradual 7-day transition. Would you like a sample pack to see how Bruno responds before committing to a full bag?",
        "response_timestamp": "2025-06-23T17:20:00Z",
        "status": "resolved",
        "answer_id": 3
    },
    {
        "id": 44,
        "customer_name": "Katherine Bell",
        "pet_type": "dog",
        "pet_name": "Rex",
        "category": "brand",
        "message": "Rex has been on your Nature's Best product for about 2 years now. What are the differences between that and your Premium Plus series? Should I consider upgrading for my 7-year-old German Shepherd?",
        "timestamp": "2025-06-23T16:45:00Z",
        "response": "Hi Katherine, great question! Premium Plus offers enhanced joint support with glucosamine/chondroitin and higher omega-3 levels - perfect for Rex's age and breed. It has 28% protein vs Nature's Best 24%, plus probiotics for digestive health. For a 7-year-old German Shepherd, the joint support benefits would be significant. I'd recommend a gradual 7-day transition. Would you like a sample pack to see how Rex responds before committing to a full bag?",
        "response_timestamp": "2025-06-23T17:20:00Z",
        "status": "resolved",
        "answer_id": 3
    },
    {
        "id": 5,
        "customer_name": "Lisa Thompson",
        "pet_type": "cat",
        "pet_name": "Luna",
        "category": "health_problem",
        "message": "Luna developed severe diarrhea and dehydration after eating your Indoor Cat formula for a week. My vet suspects food intolerance. What ingredients changed in your recent reformulation?",
        "timestamp": "2025-06-25T11:30:00Z",
        "response": "Hi Lisa, I'm very sorry Luna is experiencing these symptoms. Our recent reformulation added chicory root (prebiotic) and changed from chicken fat to mixed tocopherols as preservatives. Some cats are sensitive to chicory root. Please continue following your vet's treatment plan. I'm escalating this to our quality team and arranging a full refund. We'll also send you samples of our Limited Ingredient formulas once Luna recovers. Please keep me updated on her condition.",
        "response_timestamp": "2025-06-25T12:45:00Z",
        "status": "escalated",
        "answer_id": 4
    },
    {
        "id": 25,
        "customer_name": "Diana Morgan",
        "pet_type": "cat",
        "pet_name": "Coco",
        "category": "health_problem",
        "message": "After a week on your Indoor Cat formula, Coco has had terrible diarrhea and became dehydrated. The vet thinks it might be food intolerance. Did you change any ingredients in your recent recipe update?",
        "timestamp": "2025-06-25T11:30:00Z",
        "response": "Hi Diana, I'm very sorry Coco is experiencing these symptoms. Our recent reformulation added chicory root (prebiotic) and changed from chicken fat to mixed tocopherols as preservatives. Some cats are sensitive to chicory root. Please continue following your vet's treatment plan. I'm escalating this to our quality team and arranging a full refund. We'll also send you samples of our Limited Ingredient formulas once Coco recovers. Please keep me updated on her condition.",
        "response_timestamp": "2025-06-25T12:45:00Z",
        "status": "escalated",
        "answer_id": 4
    },
    {
        "id": 45,
        "customer_name": "Gregory Hayes",
        "pet_type": "cat",
        "pet_name": "Mimi",
        "category": "health_problem",
        "message": "Mimi has been eating your Indoor Cat formula for about a week and now has bad diarrhea and signs of dehydration. My veterinarian believes it could be food intolerance. Have there been any ingredient modifications in your latest formulation?",
        "timestamp": "2025-06-25T11:30:00Z",
        "response": "Hi Gregory, I'm very sorry Mimi is experiencing these symptoms. Our recent reformulation added chicory root (prebiotic) and changed from chicken fat to mixed tocopherols as preservatives. Some cats are sensitive to chicory root. Please continue following your vet's treatment plan. I'm escalating this to our quality team and arranging a full refund. We'll also send you samples of our Limited Ingredient formulas once Mimi recovers. Please keep me updated on her condition.",
        "response_timestamp": "2025-06-25T12:45:00Z",
        "status": "escalated",
        "answer_id": 4
    },
    {
        "id": 6,
        "customer_name": "David Park",
        "pet_type": "dog",
        "pet_name": "Cooper",
        "category": "quality",
        "message": "The last bag of your Puppy Growth formula had an unusual smell and seemed more oily than normal. Cooper refused to eat it. What quality control measures do you have in place?",
        "timestamp": "2025-06-24T13:20:00Z",
        "response": "Hi David, thank you for reporting this quality concern. Please don't feed Cooper this bag. We use multi-point quality testing including sensory evaluation, but occasionally issues occur. I need your bag's lot number and best-by date to investigate. Our quality team will analyze this batch immediately. I'm arranging a replacement bag via overnight shipping and a full refund. We also test every 15 minutes during production and conduct third-party lab testing.",
        "response_timestamp": "2025-06-24T14:10:00Z",
        "status": "investigating",
        "answer_id": 5
    },
    {
        "id": 26,
        "customer_name": "Ryan Phillips",
        "pet_type": "dog",
        "pet_name": "Scout",
        "category": "quality",
        "message": "I opened a new bag of your Puppy Growth formula and it has a strange odor and feels greasier than usual. Scout won't touch it. Can you tell me about your quality control processes?",
        "timestamp": "2025-06-24T13:20:00Z",
        "response": "Hi Ryan, thank you for reporting this quality concern. Please don't feed Scout this bag. We use multi-point quality testing including sensory evaluation, but occasionally issues occur. I need your bag's lot number and best-by date to investigate. Our quality team will analyze this batch immediately. I'm arranging a replacement bag via overnight shipping and a full refund. We also test every 15 minutes during production and conduct third-party lab testing.",
        "response_timestamp": "2025-06-24T14:10:00Z",
        "status": "investigating",
        "answer_id": 5
    },
    {
        "id": 46,
        "customer_name": "Brenda Scott",
        "pet_type": "dog",
        "pet_name": "Toby",
        "category": "quality",
        "message": "My recent purchase of Puppy Growth formula smells off and has an unusually oily texture. Toby completely refuses to eat it. What kind of quality control do you implement for your products?",
        "timestamp": "2025-06-24T13:20:00Z",
        "response": "Hi Brenda, thank you for reporting this quality concern. Please don't feed Toby this bag. We use multi-point quality testing including sensory evaluation, but occasionally issues occur. I need your bag's lot number and best-by date to investigate. Our quality team will analyze this batch immediately. I'm arranging a replacement bag via overnight shipping and a full refund. We also test every 15 minutes during production and conduct third-party lab testing.",
        "response_timestamp": "2025-06-24T14:10:00Z",
        "status": "investigating",
        "answer_id": 5
    },
    {
        "id": 7,
        "customer_name": "Amanda Foster",
        "pet_type": "cat",
        "pet_name": "Mittens",
        "category": "shipment",
        "message": "I received the wrong flavor in my order - got Chicken instead of Fish. Mittens is very picky and won't eat chicken. How can I exchange this quickly?",
        "timestamp": "2025-06-26T08:30:00Z",
        "response": "Hi Amanda, I sincerely apologize for the mix-up! I'm immediately shipping the correct Fish flavor via express delivery - you'll have it tomorrow. Please keep the Chicken formula as our apology for the error, or donate it to a local shelter if Mittens won't eat it. I've also added a 15% credit to your account for future orders. I've flagged your account to prevent future flavor mix-ups.",
        "response_timestamp": "2025-06-26T09:00:00Z",
        "status": "resolved",
        "answer_id": 6
    },
    {
        "id": 27,
        "customer_name": "Craig Washington",
        "pet_type": "cat",
        "pet_name": "Princess",
        "category": "shipment",
        "message": "My order came with Chicken flavor but I ordered Fish. Princess is extremely finicky and refuses to eat anything with chicken. What's the fastest way to get this corrected?",
        "timestamp": "2025-06-26T08:30:00Z",
        "response": "Hi Craig, I sincerely apologize for the mix-up! I'm immediately shipping the correct Fish flavor via express delivery - you'll have it tomorrow. Please keep the Chicken formula as our apology for the error, or donate it to a local shelter if Princess won't eat it. I've also added a 15% credit to your account for future orders. I've flagged your account to prevent future flavor mix-ups.",
        "response_timestamp": "2025-06-26T09:00:00Z",
        "status": "resolved",
        "answer_id": 6
    },
    {
        "id": 47,
        "customer_name": "Heather Ross",
        "pet_type": "cat",
        "pet_name": "Jasper",
        "category": "shipment",
        "message": "There was an error with my delivery - I received Chicken variety when I specifically ordered Fish. Jasper is very selective and won't touch chicken flavored food. How quickly can you fix this?",
        "timestamp": "2025-06-26T08:30:00Z",
        "response": "Hi Heather, I sincerely apologize for the mix-up! I'm immediately shipping the correct Fish flavor via express delivery - you'll have it tomorrow. Please keep the Chicken formula as our apology for the error, or donate it to a local shelter if Jasper won't eat it. I've also added a 15% credit to your account for future orders. I've flagged your account to prevent future flavor mix-ups.",
        "response_timestamp": "2025-06-26T09:00:00Z",
        "status": "resolved",
        "answer_id": 6
    },
    {
        "id": 8,
        "customer_name": "Robert Kim",
        "pet_type": "dog",
        "pet_name": "Zeus",
        "category": "brand",
        "message": "I'm considering switching from your Classic line to your Holistic Wellness brand. Zeus has sensitive skin - which formula would be best for a Husky with allergies?",
        "timestamp": "2025-06-25T15:10:00Z",
        "response": "Hi Robert, for Zeus's sensitive skin and breed-specific needs, I recommend our Holistic Wellness Limited Ingredient Salmon & Sweet Potato formula. It's specifically designed for food sensitivities with a single protein source, omega-3 for coat health, and no common allergens like chicken, beef, or grains. Huskies often do well with fish-based proteins. I can send you a sample pack and our transition guide. Our Holistic line also includes prebiotics for immune support.",
        "response_timestamp": "2025-06-25T15:45:00Z",
        "status": "resolved",
        "answer_id": 7
    },
    {
        "id": 28,
        "customer_name": "Sandra Powell",
        "pet_type": "dog",
        "pet_name": "Storm",
        "category": "brand",
        "message": "I'm thinking about changing Storm from your Classic formula to the Holistic Wellness line. He's a Husky with skin sensitivities and allergies - what would you recommend?",
        "timestamp": "2025-06-25T15:10:00Z",
        "response": "Hi Sandra, for Storm's sensitive skin and breed-specific needs, I recommend our Holistic Wellness Limited Ingredient Salmon & Sweet Potato formula. It's specifically designed for food sensitivities with a single protein source, omega-3 for coat health, and no common allergens like chicken, beef, or grains. Huskies often do well with fish-based proteins. I can send you a sample pack and our transition guide. Our Holistic line also includes prebiotics for immune support.",
        "response_timestamp": "2025-06-25T15:45:00Z",
        "status": "resolved",
        "answer_id": 7
    },
    {
        "id": 48,
        "customer_name": "Franklin Butler",
        "pet_type": "dog",
        "pet_name": "Kodiak",
        "category": "brand",
        "message": "I want to transition Kodiak from your Classic series to your Holistic Wellness products. Since he's a Husky with sensitive skin and allergy issues, which specific formula should I choose?",
        "timestamp": "2025-06-25T15:10:00Z",
        "response": "Hi Franklin, for Kodiak's sensitive skin and breed-specific needs, I recommend our Holistic Wellness Limited Ingredient Salmon & Sweet Potato formula. It's specifically designed for food sensitivities with a single protein source, omega-3 for coat health, and no common allergens like chicken, beef, or grains. Huskies often do well with fish-based proteins. I can send you a sample pack and our transition guide. Our Holistic line also includes prebiotics for immune support.",
        "response_timestamp": "2025-06-25T15:45:00Z",
        "status": "resolved",
        "answer_id": 7
    },
    {
        "id": 9,
        "customer_name": "Jennifer Lee",
        "pet_type": "dog",
        "pet_name": "Daisy",
        "category": "health_problem",
        "message": "Daisy has been scratching excessively and developed red patches on her skin since starting your Limited Ingredient Diet. Could this be related to the sweet potato or duck protein?",
        "timestamp": "2025-06-23T12:45:00Z",
        "response": "Hi Jennifer, I'm concerned about Daisy's skin reaction. While our Limited Ingredient Diet is designed for sensitivities, any ingredient can potentially cause reactions in individual dogs. Duck protein or sweet potato could be culprits. Please discontinue this formula immediately and consult your vet about the skin patches. I recommend returning to Daisy's previous food temporarily. We'll provide a full refund and help identify a different protein source once she's healed. Please take photos of the reaction for your vet.",
        "response_timestamp": "2025-06-23T14:00:00Z",
        "status": "escalated",
        "answer_id": 8
    },
    {
        "id": 29,
        "customer_name": "Gloria Evans",
        "pet_type": "dog",
        "pet_name": "Penny",
        "category": "health_problem",
        "message": "Since switching Penny to your Limited Ingredient Diet, she's been scratching constantly and has developed red, irritated areas on her skin. Do you think it could be the duck protein or sweet potato causing this reaction?",
        "timestamp": "2025-06-23T12:45:00Z",
        "response": "Hi Gloria, I'm concerned about Penny's skin reaction. While our Limited Ingredient Diet is designed for sensitivities, any ingredient can potentially cause reactions in individual dogs. Duck protein or sweet potato could be culprits. Please discontinue this formula immediately and consult your vet about the skin patches. I recommend returning to Penny's previous food temporarily. We'll provide a full refund and help identify a different protein source once she's healed. Please take photos of the reaction for your vet.",
        "response_timestamp": "2025-06-23T14:00:00Z",
        "status": "escalated",
        "answer_id": 8
    },
    {
        "id": 49,
        "customer_name": "Vincent Gray",
        "pet_type": "dog",
        "pet_name": "Rosie",
        "category": "health_problem",
        "message": "After starting Rosie on your Limited Ingredient Diet, she won't stop scratching and now has red, inflamed spots on her skin. Could either the duck protein or sweet potato be triggering this skin issue?",
        "timestamp": "2025-06-23T12:45:00Z",
        "response": "Hi Vincent, I'm concerned about Rosie's skin reaction. While our Limited Ingredient Diet is designed for sensitivities, any ingredient can potentially cause reactions in individual dogs. Duck protein or sweet potato could be culprits. Please discontinue this formula immediately and consult your vet about the skin patches. I recommend returning to Rosie's previous food temporarily. We'll provide a full refund and help identify a different protein source once she's healed. Please take photos of the reaction for your vet.",
        "response_timestamp": "2025-06-23T14:00:00Z",
        "status": "escalated",
        "answer_id": 8
    },
    {
        "id": 10,
        "customer_name": "Mark Stevens",
        "pet_type": "cat",
        "pet_name": "Shadow",
        "category": "quality",
        "message": "The kibble size in Shadow's Senior Cat formula seems inconsistent - some pieces are much larger than others. Is this normal or a quality issue?",
        "timestamp": "2025-06-26T10:20:00Z",
        "response": "Hi Mark, thank you for bringing this to our attention. While minor size variations can occur during production, significant inconsistencies aren't normal and could indicate an equipment issue during manufacturing. I'd like to investigate this batch - please provide the lot number and best-by date. I'm sending a replacement bag immediately and will have our quality team review this production run. Consistent kibble size is important for senior cats' chewing comfort.",
        "response_timestamp": "2025-06-26T11:05:00Z",
        "status": "investigating",
        "answer_id": 9
    },
    {
        "id": 30,
        "customer_name": "Beverly Hughes",
        "pet_type": "cat",
        "pet_name": "Garfield",
        "category": "quality",
        "message": "I noticed that the kibble pieces in Garfield's Senior Cat food vary dramatically in size - some are tiny while others are quite large. Should I be concerned about this inconsistency?",
        "timestamp": "2025-06-26T10:20:00Z",
        "response": "Hi Beverly, thank you for bringing this to our attention. While minor size variations can occur during production, significant inconsistencies aren't normal and could indicate an equipment issue during manufacturing. I'd like to investigate this batch - please provide the lot number and best-by date. I'm sending a replacement bag immediately and will have our quality team review this production run. Consistent kibble size is important for senior cats' chewing comfort.",
        "response_timestamp": "2025-06-26T11:05:00Z",
        "status": "investigating",
        "answer_id": 9
    },
    {
        "id": 50,
        "customer_name": "Eugene Foster",
        "pet_type": "cat",
        "pet_name": "Oreo",
        "category": "quality",
        "message": "The Senior Cat formula I bought for Oreo has very uneven kibble sizes - there's a big difference between the smallest and largest pieces. Is this typical or is there a production problem?",
        "timestamp": "2025-06-26T10:20:00Z",
        "response": "Hi Eugene, thank you for bringing this to our attention. While minor size variations can occur during production, significant inconsistencies aren't normal and could indicate an equipment issue during manufacturing. I'd like to investigate this batch - please provide the lot number and best-by date. I'm sending a replacement bag immediately and will have our quality team review this production run. Consistent kibble size is important for senior cats' chewing comfort.",
        "response_timestamp": "2025-06-26T11:05:00Z",
        "status": "investigating",
        "answer_id": 9
    },
    {
        "id": 11,
        "customer_name": "Rachel Green",
        "pet_type": "dog",
        "pet_name": "Buddy",
        "category": "shipment",
        "message": "My order arrived damaged - the bag was torn and food was spilled everywhere. Buddy's food is contaminated and I need a replacement urgently. Order #12345",
        "timestamp": "2025-06-24T17:30:00Z",
        "response": "Hi Rachel, I'm so sorry about the damaged shipment! This is completely unacceptable. I'm immediately shipping a replacement via overnight delivery - you'll have it tomorrow morning. I'm also investigating with our shipping partner to prevent future damage. Please take photos of the damage for our records and dispose of the contaminated food safely. I've added a credit to your account for this terrible experience. Order #12345 replacement is being expedited now.",
        "response_timestamp": "2025-06-24T18:00:00Z",
        "status": "resolved",
        "answer_id": 10
    },
    {
        "id": 31,
        "customer_name": "Howard Perry",
        "pet_type": "dog",
        "pet_name": "Jake",
        "category": "shipment",
        "message": "The package I received was completely destroyed - the bag split open and Jake's food spilled out all over the box. The food is now contaminated and I desperately need a replacement. My order number is #12345",
        "timestamp": "2025-06-24T17:30:00Z",
        "response": "Hi Howard, I'm so sorry about the damaged shipment! This is completely unacceptable. I'm immediately shipping a replacement via overnight delivery - you'll have it tomorrow morning. I'm also investigating with our shipping partner to prevent future damage. Please take photos of the damage for our records and dispose of the contaminated food safely. I've added a credit to your account for this terrible experience. Order #12345 replacement is being expedited now.",
        "response_timestamp": "2025-06-24T18:00:00Z",
        "status": "resolved",
        "answer_id": 10
    },
    {
        "id": 51,
        "customer_name": "Joyce Coleman",
        "pet_type": "dog",
        "pet_name": "Sadie",
        "category": "shipment",
        "message": "When my delivery arrived, the food bag had a huge tear and Sadie's food was scattered throughout the shipping box. Everything is now contaminated and unusable. I urgently need a replacement - order #12345",
        "timestamp": "2025-06-24T17:30:00Z",
        "response": "Hi Joyce, I'm so sorry about the damaged shipment! This is completely unacceptable. I'm immediately shipping a replacement via overnight delivery - you'll have it tomorrow morning. I'm also investigating with our shipping partner to prevent future damage. Please take photos of the damage for our records and dispose of the contaminated food safely. I've added a credit to your account for this terrible experience. Order #12345 replacement is being expedited now.",
        "response_timestamp": "2025-06-24T18:00:00Z",
        "status": "resolved",
        "answer_id": 10
    },
    {
        "id": 12,
        "customer_name": "Tom Anderson",
        "pet_type": "cat",
        "pet_name": "Cleo",
        "category": "brand",
        "message": "What's the difference between your Indoor Formula and your Weight Management line? Cleo is an indoor cat who's gained weight recently.",
        "timestamp": "2025-06-25T14:00:00Z",
        "response": "Hi Tom, great question! Our Indoor Formula focuses on hairball control and moderate activity levels (310 kcal/cup), while Weight Management is specifically for weight loss with reduced calories (280 kcal/cup) and higher fiber to promote satiety. For Cleo's weight gain, I'd recommend Weight Management with controlled portions. It includes L-carnitine to help burn fat and maintain muscle. I can send you a feeding guide and sample to ensure Cleo likes it before switching completely.",
        "response_timestamp": "2025-06-25T14:30:00Z",
        "status": "resolved",
        "answer_id": 11
    },
    {
        "id": 32,
        "customer_name": "Dorothy Ward",
        "pet_type": "cat",
        "pet_name": "Whiskers",
        "category": "brand",
        "message": "Can you explain how your Indoor Formula compares to the Weight Management product? Whiskers stays inside and has been putting on extra pounds lately.",
        "timestamp": "2025-06-25T14:00:00Z",
        "response": "Hi Dorothy, great question! Our Indoor Formula focuses on hairball control and moderate activity levels (310 kcal/cup), while Weight Management is specifically for weight loss with reduced calories (280 kcal/cup) and higher fiber to promote satiety. For Whiskers' weight gain, I'd recommend Weight Management with controlled portions. It includes L-carnitine to help burn fat and maintain muscle. I can send you a feeding guide and sample to ensure Whiskers likes it before switching completely.",
        "response_timestamp": "2025-06-25T14:30:00Z",
        "status": "resolved",
        "answer_id": 11
    },
    {
        "id": 52,
        "customer_name": "Jerry Brooks",
        "pet_type": "cat",
        "pet_name": "Snowball",
        "category": "brand",
        "message": "I need to understand the distinctions between your Indoor Formula and Weight Management formulas. Snowball is an indoor cat and has been gaining weight recently.",
        "timestamp": "2025-06-25T14:00:00Z",
        "response": "Hi Jerry, great question! Our Indoor Formula focuses on hairball control and moderate activity levels (310 kcal/cup), while Weight Management is specifically for weight loss with reduced calories (280 kcal/cup) and higher fiber to promote satiety. For Snowball's weight gain, I'd recommend Weight Management with controlled portions. It includes L-carnitine to help burn fat and maintain muscle. I can send you a feeding guide and sample to ensure Snowball likes it before switching completely.",
        "response_timestamp": "2025-06-25T14:30:00Z",
        "status": "resolved",
        "answer_id": 11
    },
    {
        "id": 13,
        "customer_name": "Nicole Davis",
        "pet_type": "dog",
        "pet_name": "Milo",
        "category": "health_problem",
        "message": "Milo has had loose stools for over a week since transitioning to your High Protein formula. I followed the transition guide exactly. What could be causing this?",
        "timestamp": "2025-06-26T11:45:00Z",
        "response": "Hi Nicole, loose stools for a week is concerning. While some dogs need longer transitions, this could indicate the high protein content (32%) is too rich for Milo's digestive system. Please gradually transition back to his previous food and consult your vet if symptoms persist. Some dogs do better with moderate protein levels (22-26%). Once Milo's stools normalize, I can recommend a gentler formula with probiotics. We'll provide a full refund for the High Protein formula.",
        "response_timestamp": "2025-06-26T12:30:00Z",
        "status": "resolved",
        "answer_id": 12
    },
    {
        "id": 33,
        "customer_name": "Ralph Richardson",
        "pet_type": "dog",
        "pet_name": "Oscar",
        "category": "health_problem",
        "message": "Oscar's bowel movements have been loose for more than a week after switching to your High Protein food. I carefully followed your transition instructions. Any idea what might be wrong?",
        "timestamp": "2025-06-26T11:45:00Z",
        "response": "Hi Ralph, loose stools for a week is concerning. While some dogs need longer transitions, this could indicate the high protein content (32%) is too rich for Oscar's digestive system. Please gradually transition back to his previous food and consult your vet if symptoms persist. Some dogs do better with moderate protein levels (22-26%). Once Oscar's stools normalize, I can recommend a gentler formula with probiotics. We'll provide a full refund for the High Protein formula.",
        "response_timestamp": "2025-06-26T12:30:00Z",
        "status": "resolved",
        "answer_id": 12
    },
    {
        "id": 53,
        "customer_name": "Phyllis Watson",
        "pet_type": "dog",
        "pet_name": "Gus",
        "category": "health_problem",
        "message": "Ever since I started transitioning Gus to your High Protein formula, he's had soft, loose stools for over a week. I followed your transition schedule perfectly. What do you think is happening?",
        "timestamp": "2025-06-26T11:45:00Z",
        "response": "Hi Phyllis, loose stools for a week is concerning. While some dogs need longer transitions, this could indicate the high protein content (32%) is too rich for Gus's digestive system. Please gradually transition back to his previous food and consult your vet if symptoms persist. Some dogs do better with moderate protein levels (22-26%). Once Gus's stools normalize, I can recommend a gentler formula with probiotics. We'll provide a full refund for the High Protein formula.",
        "response_timestamp": "2025-06-26T12:30:00Z",
        "status": "resolved",
        "answer_id": 12
    },
    {
        "id": 14,
        "customer_name": "Kevin Brown",
        "pet_type": "cat",
        "pet_name": "Patches",
        "category": "quality",
        "message": "I found what appears to be foreign material in Patches' wet food can - looks like plastic fragments. This is concerning for safety. Lot #ABC123",
        "timestamp": "2025-06-23T09:30:00Z",
        "response": "Hi Kevin, this is extremely serious and I sincerely apologize. Please do not feed this can to Patches. I'm immediately escalating this to our quality assurance team and initiating an investigation of lot #ABC123. Please save the can and contents for analysis. I'm arranging an immediate refund and replacement products. Our quality team will contact you within 24 hours. Thank you for reporting this critical safety issue - it helps us protect all pets.",
        "response_timestamp": "2025-06-23T10:00:00Z",
        "status": "critical_escalation",
        "answer_id": 13
    },
    {
        "id": 34,
        "customer_name": "Arthur Kelly",
        "pet_type": "cat",
        "pet_name": "Dusty",
        "category": "quality",
        "message": "I discovered what looks like plastic pieces in Dusty's canned food. This is a serious safety concern. The lot number is ABC123",
        "timestamp": "2025-06-23T09:30:00Z",
        "response": "Hi Arthur, this is extremely serious and I sincerely apologize. Please do not feed this can to Dusty. I'm immediately escalating this to our quality assurance team and initiating an investigation of lot #ABC123. Please save the can and contents for analysis. I'm arranging an immediate refund and replacement products. Our quality team will contact you within 24 hours. Thank you for reporting this critical safety issue - it helps us protect all pets.",
        "response_timestamp": "2025-06-23T10:00:00Z",
        "status": "critical_escalation",
        "answer_id": 13
    },
    {
        "id": 54,
        "customer_name": "Doris Murphy",
        "pet_type": "cat",
        "pet_name": "Smoky",
        "category": "quality",
        "message": "There are plastic-like fragments in Smoky's wet food can that I just opened. This is very alarming from a safety standpoint. Lot #ABC123",
        "timestamp": "2025-06-23T09:30:00Z",
        "response": "Hi Doris, this is extremely serious and I sincerely apologize. Please do not feed this can to Smoky. I'm immediately escalating this to our quality assurance team and initiating an investigation of lot #ABC123. Please save the can and contents for analysis. I'm arranging an immediate refund and replacement products. Our quality team will contact you within 24 hours. Thank you for reporting this critical safety issue - it helps us protect all pets.",
        "response_timestamp": "2025-06-23T10:00:00Z",
        "status": "critical_escalation",
        "answer_id": 13
    },
    {
        "id": 15,
        "customer_name": "Stephanie White",
        "pet_type": "dog",
        "pet_name": "Ruby",
        "category": "shipment",
        "message": "I've been waiting 3 weeks for my backorder of Ruby's special Kidney Support formula. When will this be back in stock? She can't eat regular food.",
        "timestamp": "2025-06-25T16:20:00Z",
        "response": "Hi Stephanie, I understand how critical this is for Ruby's health. Our Kidney Support formula experienced supply chain delays, but I have good news - we're receiving stock this Friday. I'm prioritizing your order for immediate shipment once it arrives. I'm also contacting our veterinary nutrition team to recommend a temporary alternative if Ruby needs food before Friday. I'll personally monitor your order and provide daily updates until it ships.",
        "response_timestamp": "2025-06-25T17:00:00Z",
        "status": "priority_handling",
        "answer_id": 14
    },
    {
        "id": 35,
        "customer_name": "Willie Barnes",
        "pet_type": "dog",
        "pet_name": "Annie",
        "category": "shipment",
        "message": "It's been 3 weeks since I ordered Annie's Kidney Support formula and it's still on backorder. When can I expect it to be available? She has special dietary requirements and can't have normal dog food.",
        "timestamp": "2025-06-25T16:20:00Z",
        "response": "Hi Willie, I understand how critical this is for Annie's health. Our Kidney Support formula experienced supply chain delays, but I have good news - we're receiving stock this Friday. I'm prioritizing your order for immediate shipment once it arrives. I'm also contacting our veterinary nutrition team to recommend a temporary alternative if Annie needs food before Friday. I'll personally monitor your order and provide daily updates until it ships.",
        "response_timestamp": "2025-06-25T17:00:00Z",
        "status": "priority_handling",
        "answer_id": 14
    },
    {
        "id": 55,
        "customer_name": "Martha Cooper",
        "pet_type": "dog",
        "pet_name": "Maggie",
        "category": "shipment",
        "message": "I placed an order for Maggie's Kidney Support formula three weeks ago and it's still backordered. Do you have any update on when this will be restocked? She has medical dietary restrictions and regular food isn't an option.",
        "timestamp": "2025-06-25T16:20:00Z",
        "response": "Hi Martha, I understand how critical this is for Maggie's health. Our Kidney Support formula experienced supply chain delays, but I have good news - we're receiving stock this Friday. I'm prioritizing your order for immediate shipment once it arrives. I'm also contacting our veterinary nutrition team to recommend a temporary alternative if Maggie needs food before Friday. I'll personally monitor your order and provide daily updates until it ships.",
        "response_timestamp": "2025-06-25T17:00:00Z",
        "status": "priority_handling",
        "answer_id": 14
    },
    {
        "id": 16,
        "customer_name": "Alex Martinez",
        "pet_type": "cat",
        "pet_name": "Tiger",
        "category": "brand",
        "message": "Can you explain the difference between your Grain-Free and Ancient Grains lines? Tiger has been on grain-free but I'm reading conflicting information about DCM in cats.",
        "timestamp": "2025-06-24T10:15:00Z",
        "response": "Hi Alex, excellent question! DCM concerns are primarily documented in dogs, with limited evidence in cats. Our Grain-Free uses peas and potatoes as carb sources, while Ancient Grains includes quinoa, millet, and chia seeds. Both are nutritionally complete. For cats, the choice often depends on digestive sensitivity rather than DCM risk. Tiger's doing well on grain-free, so switching isn't necessary unless he shows issues. I can send you the latest veterinary research on DCM in cats if you'd like to review it.",
        "response_timestamp": "2025-06-24T11:00:00Z",
        "status": "resolved",
        "answer_id": 15
    },
    {
        "id": 36,
        "customer_name": "Roy Jenkins",
        "pet_type": "cat",
        "pet_name": "Boots",
        "category": "brand",
        "message": "What are the differences between your Grain-Free and Ancient Grains product lines? Boots is currently eating grain-free food, but I've been seeing mixed reports about DCM in cats.",
        "timestamp": "2025-06-24T10:15:00Z",
        "response": "Hi Roy, excellent question! DCM concerns are primarily documented in dogs, with limited evidence in cats. Our Grain-Free uses peas and potatoes as carb sources, while Ancient Grains includes quinoa, millet, and chia seeds. Both are nutritionally complete. For cats, the choice often depends on digestive sensitivity rather than DCM risk. Boots' doing well on grain-free, so switching isn't necessary unless he shows issues. I can send you the latest veterinary research on DCM in cats if you'd like to review it.",
        "response_timestamp": "2025-06-24T11:00:00Z",
        "status": "resolved",
        "answer_id": 15
    },
    {
        "id": 56,
        "customer_name": "Cheryl Long",
        "pet_type": "cat",
        "pet_name": "Midnight",
        "category": "brand",
        "message": "Could you clarify the distinctions between your Grain-Free versus Ancient Grains formulas? Midnight is on grain-free currently, but I've heard conflicting things about DCM risks in cats.",
        "timestamp": "2025-06-24T10:15:00Z",
        "response": "Hi Cheryl, excellent question! DCM concerns are primarily documented in dogs, with limited evidence in cats. Our Grain-Free uses peas and potatoes as carb sources, while Ancient Grains includes quinoa, millet, and chia seeds. Both are nutritionally complete. For cats, the choice often depends on digestive sensitivity rather than DCM risk. Midnight's doing well on grain-free, so switching isn't necessary unless she shows issues. I can send you the latest veterinary research on DCM in cats if you'd like to review it.",
        "response_timestamp": "2025-06-24T11:00:00Z",
        "status": "resolved",
        "answer_id": 15
    },
    {
        "id": 17,
        "customer_name": "Karen Moore",
        "pet_type": "dog",
        "pet_name": "Charlie",
        "category": "health_problem",
        "message": "Charlie has been drinking excessive water and urinating frequently since starting your Senior Dog formula 2 weeks ago. Could this be diet-related or should I see a vet?",
        "timestamp": "2025-06-26T13:30:00Z",
        "response": "Hi Karen, excessive thirst and urination are serious symptoms that require immediate veterinary attention, especially in senior dogs. While dietary changes can sometimes cause mild increases in water intake, Charlie's symptoms could indicate diabetes, kidney issues, or other serious conditions. Please see your vet immediately and mention the diet change. Discontinue the Senior formula temporarily until you get veterinary clearance. This isn't likely food-related, but your vet needs to rule out medical causes first.",
        "response_timestamp": "2025-06-26T14:00:00Z",
        "status": "urgent_medical_referral",
        "answer_id": 16
    },
    {
        "id": 37,
        "customer_name": "Ruth Price",
        "pet_type": "dog",
        "pet_name": "Buster",
        "category": "health_problem",
        "message": "Since I started Buster on your Senior Dog formula two weeks ago, he's been drinking lots of water and needing to go outside to urinate much more often. Do you think this is caused by the food or should I contact my vet?",
        "timestamp": "2025-06-26T13:30:00Z",
        "response": "Hi Ruth, excessive thirst and urination are serious symptoms that require immediate veterinary attention, especially in senior dogs. While dietary changes can sometimes cause mild increases in water intake, Buster's symptoms could indicate diabetes, kidney issues, or other serious conditions. Please see your vet immediately and mention the diet change. Discontinue the Senior formula temporarily until you get veterinary clearance. This isn't likely food-related, but your vet needs to rule out medical causes first.",
        "response_timestamp": "2025-06-26T14:00:00Z",
        "status": "urgent_medical_referral",
        "answer_id": 16
    },
    {
        "id": 57,
        "customer_name": "Wayne Russell",
        "pet_type": "dog",
        "pet_name": "Buddy",
        "category": "health_problem",
        "message": "Ever since Buddy started eating your Senior Dog formula about 2 weeks ago, he's been consuming way more water than usual and having to urinate constantly. Is this something the food could cause or do I need to get him to a veterinarian?",
        "timestamp": "2025-06-26T13:30:00Z",
        "response": "Hi Wayne, excessive thirst and urination are serious symptoms that require immediate veterinary attention, especially in senior dogs. While dietary changes can sometimes cause mild increases in water intake, Buddy's symptoms could indicate diabetes, kidney issues, or other serious conditions. Please see your vet immediately and mention the diet change. Discontinue the Senior formula temporarily until you get veterinary clearance. This isn't likely food-related, but your vet needs to rule out medical causes first.",
        "response_timestamp": "2025-06-26T14:00:00Z",
        "status": "urgent_medical_referral",
        "answer_id": 16
    },
    {
        "id": 18,
        "customer_name": "Daniel Taylor",
        "pet_type": "cat",
        "pet_name": "Smokey",
        "category": "quality",
        "message": "The texture of Smokey's wet food seems different lately - more watery and less chunky. Has the recipe changed? He's not as interested in eating it now.",
        "timestamp": "2025-06-25T12:10:00Z",
        "response": "Hi Daniel, thank you for noticing this change. We haven't modified the recipe, but texture variations can occur due to processing conditions or ingredient moisture levels. This shouldn't affect nutrition, but I understand Smokey's preference matters. Please provide the lot numbers from recent cans so our quality team can investigate. I'm sending replacement cans from a different production run, plus some pâté-style options Smokey might prefer. We take texture consistency seriously.",
        "response_timestamp": "2025-06-25T13:00:00Z",
        "status": "investigating",
        "answer_id": 17
    },
    {
        "id": 38,
        "customer_name": "Lawrence Peterson",
        "pet_type": "cat",
        "pet_name": "Fluffy",
        "category": "quality",
        "message": "I've noticed Fluffy's wet food has a different consistency recently - it appears more liquid and has fewer chunks than before. Did you change the formulation? She seems less interested in it.",
        "timestamp": "2025-06-25T12:10:00Z",
        "response": "Hi Lawrence, thank you for noticing this change. We haven't modified the recipe, but texture variations can occur due to processing conditions or ingredient moisture levels. This shouldn't affect nutrition, but I understand Fluffy's preference matters. Please provide the lot numbers from recent cans so our quality team can investigate. I'm sending replacement cans from a different production run, plus some pâté-style options Fluffy might prefer. We take texture consistency seriously.",
        "response_timestamp": "2025-06-25T13:00:00Z",
        "status": "investigating",
        "answer_id": 17
    },
    {
        "id": 58,
        "customer_name": "Janet Stewart",
        "pet_type": "cat",
        "pet_name": "Oliver",
        "category": "quality",
        "message": "Oliver's canned food texture has changed - it's much more watery with fewer solid pieces than usual. Have there been any recipe modifications? He doesn't seem to like it as much anymore.",
        "timestamp": "2025-06-25T12:10:00Z",
        "response": "Hi Janet, thank you for noticing this change. We haven't modified the recipe, but texture variations can occur due to processing conditions or ingredient moisture levels. This shouldn't affect nutrition, but I understand Oliver's preference matters. Please provide the lot numbers from recent cans so our quality team can investigate. I'm sending replacement cans from a different production run, plus some pâté-style options Oliver might prefer. We take texture consistency seriously.",
        "response_timestamp": "2025-06-25T13:00:00Z",
        "status": "investigating",
        "answer_id": 17
    },
    {
        "id": 19,
        "customer_name": "Melissa Garcia",
        "pet_type": "dog",
        "pet_name": "Luna",
        "category": "shipment",
        "message": "My auto-ship delivery came 5 days early and I already had food. Now I have too much and it might expire. Can you adjust my delivery schedule?",
        "timestamp": "2025-06-23T14:50:00Z",
        "response": "Hi Melissa, I apologize for the scheduling error! I've adjusted your auto-ship to deliver every 6 weeks instead of 4 weeks to prevent overstock. Your next delivery is now scheduled for August 4th. The food you received has a 12-month shelf life, so it won't expire soon, but I understand the inconvenience. I've added a 10% credit to your account for the early delivery issue. You can always adjust timing in your account portal or contact us anytime.",
        "response_timestamp": "2025-06-23T15:30:00Z",
        "status": "resolved",
        "answer_id": 18
    },
    {
        "id": 39,
        "customer_name": "Gary Torres",
        "pet_type": "dog",
        "pet_name": "Roxy",
        "category": "shipment",
        "message": "My automatic delivery arrived 5 days ahead of schedule when I still had plenty of food left. Now I'm overstocked and worried about expiration dates. Is it possible to modify my delivery timing?",
        "timestamp": "2025-06-23T14:50:00Z",
        "response": "Hi Gary, I apologize for the scheduling error! I've adjusted your auto-ship to deliver every 6 weeks instead of 4 weeks to prevent overstock. Your next delivery is now scheduled for August 4th. The food you received has a 12-month shelf life, so it won't expire soon, but I understand the inconvenience. I've added a 10% credit to your account for the early delivery issue. You can always adjust timing in your account portal or contact us anytime.",
        "response_timestamp": "2025-06-23T15:30:00Z",
        "status": "resolved",
        "answer_id": 18
    },
    {
        "id": 59,
        "customer_name": "Frances Wood",
        "pet_type": "dog",
        "pet_name": "Lily",
        "category": "shipment",
        "message": "My subscription shipment was delivered 5 days sooner than expected, but I still have food left from the previous order. Now I have excess inventory and I'm concerned about freshness. Can you change my delivery frequency?",
        "timestamp": "2025-06-23T14:50:00Z",
        "response": "Hi Frances, I apologize for the scheduling error! I've adjusted your auto-ship to deliver every 6 weeks instead of 4 weeks to prevent overstock. Your next delivery is now scheduled for August 4th. The food you received has a 12-month shelf life, so it won't expire soon, but I understand the inconvenience. I've added a 10% credit to your account for the early delivery issue. You can always adjust timing in your account portal or contact us anytime.",
        "response_timestamp": "2025-06-23T15:30:00Z",
        "status": "resolved",
        "answer_id": 18
    },
    {
        "id": 20,
        "customer_name": "Chris Johnson",
        "pet_type": "dog",
        "pet_name": "Bear",
        "category": "health_problem",
        "message": "Bear has been refusing to eat and seems nauseous after trying your new Venison & Sweet Potato formula. He's lost 3 pounds in a week. This is very concerning - is there a recall?",
        "timestamp": "2025-06-26T15:40:00Z",
        "response": "Hi Chris, Bear's symptoms are very serious - 3 pounds of weight loss in a week requires immediate veterinary attention. Please stop feeding the Venison formula immediately and see your vet today. There's no current recall, but I'm escalating this to our safety team for investigation. Please bring the food packaging to your vet and keep some product for potential testing. I'm arranging a full refund and will personally follow up on Bear's condition. His health is our top priority.",
        "response_timestamp": "2025-06-26T16:00:00Z",
        "status": "critical_escalation",
        "answer_id": 19
    },
    {
        "id": 40,
        "customer_name": "Louis Griffin",
        "pet_type": "dog",
        "pet_name": "Ace",
        "category": "health_problem",
        "message": "Since trying your new Venison & Sweet Potato formula, Ace won't eat and appears nauseated. He's dropped 3 pounds in just one week. I'm really worried - has this product been recalled?",
        "timestamp": "2025-06-26T15:40:00Z",
        "response": "Hi Louis, Ace's symptoms are very serious - 3 pounds of weight loss in a week requires immediate veterinary attention. Please stop feeding the Venison formula immediately and see your vet today. There's no current recall, but I'm escalating this to our safety team for investigation. Please bring the food packaging to your vet and keep some product for potential testing. I'm arranging a full refund and will personally follow up on Ace's condition. His health is our top priority.",
        "response_timestamp": "2025-06-26T16:00:00Z",
        "status": "critical_escalation",
        "answer_id": 19
    },
    {
        "id": 60,
        "customer_name": "Alice Henderson",
        "pet_type": "dog",
        "pet_name": "Max",
        "category": "health_problem",
        "message": "After starting Max on your new Venison & Sweet Potato formula, he's stopped eating and acts sick to his stomach. He's lost 3 pounds this week. This is alarming - should I be concerned about a product recall?",
        "timestamp": "2025-06-26T15:40:00Z",
        "response": "Hi Alice, Max's symptoms are very serious - 3 pounds of weight loss in a week requires immediate veterinary attention. Please stop feeding the Venison formula immediately and see your vet today. There's no current recall, but I'm escalating this to our safety team for investigation. Please bring the food packaging to your vet and keep some product for potential testing. I'm arranging a full refund and will personally follow up on Max's condition. His health is our top priority.",
        "response_timestamp": "2025-06-26T16:00:00Z",
        "status": "critical_escalation",
        "answer_id": 19
    }
]