{
    "0": "Our Premium Adult formula contains 26% protein with chicken meal sourced from USDA-inspected facilities. The chicken meal provides concentrated protein (65% protein content). However, decreased energy could indicate various factors. I recommend consulting your vet to rule out health issues. We're happy to send you our complete nutritional analysis and can suggest our High Energy formula if appropriate after vet consultation.",
    "1": "I'm very concerned about these symptoms. Please discontinue the Salmon & Rice formula immediately and contact your veterinarian today. Vomiting for 3 days with lethargy requires immediate medical attention. This could indicate food intolerance, allergies, or other serious conditions. Please keep the product packaging for your vet's reference. We'll arrange a full refund and help identify a suitable alternative once your pet is healthy.",
    "2": "I apologize for the delay. I've checked your tracking and see the package is delayed due to weather. I'm immediately shipping an expedited replacement via overnight delivery at no charge. You'll receive tracking within 2 hours. Your original order will still arrive, so please keep it for future use or we can arrange return pickup. I've also added a credit to your account for the inconvenience.",
    "3": "Great question! Premium Plus offers enhanced joint support with glucosamine/chondroitin and higher omega-3 levels - perfect for a 7-year-old German Shepherd. It has 28% protein vs Nature's Best 24%, plus probiotics for digestive health. For a dog this age and breed, the joint support benefits would be significant. I'd recommend a gradual 7-day transition. Would you like a sample pack to see how your pet responds before committing to a full bag?",
    "4": "I'm very sorry your cat is experiencing these symptoms. Our recent reformulation added chicory root (prebiotic) and changed from chicken fat to mixed tocopherols as preservatives. Some cats are sensitive to chicory root. Please continue following your vet's treatment plan. I'm escalating this to our quality team and arranging a full refund. We'll also send you samples of our Limited Ingredient formulas once your pet recovers. Please keep me updated on the condition.",
    "5": "Thank you for reporting this quality concern. Please don't feed your dog this bag. We use multi-point quality testing including sensory evaluation, but occasionally issues occur. I need your bag's lot number and best-by date to investigate. Our quality team will analyze this batch immediately. I'm arranging a replacement bag via overnight shipping and a full refund. We also test every 15 minutes during production and conduct third-party lab testing.",
    "6": "I sincerely apologize for the mix-up! I'm immediately shipping the correct Fish flavor via express delivery - you'll have it tomorrow. Please keep the Chicken formula as our apology for the error, or donate it to a local shelter if your cat won't eat it. I've also added a 15% credit to your account for future orders. I've flagged your account to prevent future flavor mix-ups.",
    "7": "For sensitive skin and Husky breed-specific needs, I recommend our Holistic Wellness Limited Ingredient Salmon & Sweet Potato formula. It's specifically designed for food sensitivities with a single protein source, omega-3 for coat health, and no common allergens like chicken, beef, or grains. Huskies often do well with fish-based proteins. I can send you a sample pack and our transition guide. Our Holistic line also includes prebiotics for immune support.",
    "8": "I'm concerned about the skin reaction. While our Limited Ingredient Diet is designed for sensitivities, any ingredient can potentially cause reactions in individual dogs. Duck protein or sweet potato could be culprits. Please discontinue this formula immediately and consult your vet about the skin patches. I recommend returning to your pet's previous food temporarily. We'll provide a full refund and help identify a different protein source once your pet is healed. Please take photos of the reaction for your vet.",
    "9": "Thank you for bringing this to our attention. While minor size variations can occur during production, significant inconsistencies aren't normal and could indicate an equipment issue during manufacturing. I'd like to investigate this batch - please provide the lot number and best-by date. I'm sending a replacement bag immediately and will have our quality team review this production run. Consistent kibble size is important for senior cats' chewing comfort.",
    "10": "I'm so sorry about the damaged shipment! This is completely unacceptable. I'm immediately shipping a replacement via overnight delivery - you'll have it tomorrow morning. I'm also investigating with our shipping partner to prevent future damage. Please take photos of the damage for our records and dispose of the contaminated food safely. I've added a credit to your account for this terrible experience. Order #12345 replacement is being expedited now.",
    "11": "Great question! Our Indoor Formula focuses on hairball control and moderate activity levels (310 kcal/cup), while Weight Management is specifically for weight loss with reduced calories (280 kcal/cup) and higher fiber to promote satiety. For weight gain concerns, I'd recommend Weight Management with controlled portions. It includes L-carnitine to help burn fat and maintain muscle. I can send you a feeding guide and sample to ensure your cat likes it before switching completely.",
    "12": "Loose stools for a week is concerning. While some dogs need longer transitions, this could indicate the high protein content (32%) is too rich for your dog's digestive system. Please gradually transition back to the previous food and consult your vet if symptoms persist. Some dogs do better with moderate protein levels (22-26%). Once your dog's stools normalize, I can recommend a gentler formula with probiotics. We'll provide a full refund for the High Protein formula.",
    "13": "This is extremely serious and I sincerely apologize. Please do not feed this can to your cat. I'm immediately escalating this to our quality assurance team and initiating an investigation of lot #ABC123. Please save the can and contents for analysis. I'm arranging an immediate refund and replacement products. Our quality team will contact you within 24 hours. Thank you for reporting this critical safety issue - it helps us protect all pets.",
    "14": "I understand how critical this is for your pet's health. Our Kidney Support formula experienced supply chain delays, but I have good news - we're receiving stock this Friday. I'm prioritizing your order for immediate shipment once it arrives. I'm also contacting our veterinary nutrition team to recommend a temporary alternative if your pet needs food before Friday. I'll personally monitor your order and provide daily updates until it ships.",
    "15": "Excellent question! DCM concerns are primarily documented in dogs, with limited evidence in cats. Our Grain-Free uses peas and potatoes as carb sources, while Ancient Grains includes quinoa, millet, and chia seeds. Both are nutritionally complete. For cats, the choice often depends on digestive sensitivity rather than DCM risk. If your cat is doing well on grain-free, switching isn't necessary unless issues develop. I can send you the latest veterinary research on DCM in cats if you'd like to review it.",
    "16": "Excessive thirst and urination are serious symptoms that require immediate veterinary attention, especially in senior dogs. While dietary changes can sometimes cause mild increases in water intake, these symptoms could indicate diabetes, kidney issues, or other serious conditions. Please see your vet immediately and mention the diet change. Discontinue the Senior formula temporarily until you get veterinary clearance. This isn't likely food-related, but your vet needs to rule out medical causes first.",
    "17": "Thank you for noticing this change. We haven't modified the recipe, but texture variations can occur due to processing conditions or ingredient moisture levels. This shouldn't affect nutrition, but I understand your cat's preference matters. Please provide the lot numbers from recent cans so our quality team can investigate. I'm sending replacement cans from a different production run, plus some pâté-style options your cat might prefer. We take texture consistency seriously.",
    "18": "I apologize for the scheduling error! I've adjusted your auto-ship to deliver every 6 weeks instead of 4 weeks to prevent overstock. Your next delivery is now scheduled for August 4th. The food you received has a 12-month shelf life, so it won't expire soon, but I understand the inconvenience. I've added a 10% credit to your account for the early delivery issue. You can always adjust timing in your account portal or contact us anytime.",
    "19": "These symptoms are very serious - 3 pounds of weight loss in a week requires immediate veterinary attention. Please stop feeding the Venison formula immediately and see your vet today. There's no current recall, but I'm escalating this to our safety team for investigation. Please bring the food packaging to your vet and keep some product for potential testing. I'm arranging a full refund and will personally follow up on your pet's condition. Your pet's health is our top priority."
}